* [EVE]()
    - [保存設置]()
* [Router Serial Port 序列埠]()
    - [Test1 - 序列埠連接]()
    - [Test2 - 乙太網路接口]()
    - [Test3 - 整合實作]()

---
# EVE
## 保存設置
* Export CFG
* STARTUP-CONFIGS

![](Image/W4-20201007/StartupConfig.PNG)

# Router Serial Port 序列埠
* 傳輸方式屬於點對點的傳輸

## Test1 - 序列埠連接
**Router setting**

![](Image/W4-20201007/setting.PNG)

* 架構圖
    - 序列 port 要選擇 s1/0

![](Image/W4-20201007/Test1.PNG)

**R1**
```sh
R1>en
R1#conf t
R1(config)#int s1/0
R1(config-if)#ip addr 12.1.1.1 255.255.255.252

# 設定時脈
R1(config-if)#clock rate 64000  
R1(config-if)#no shut
R1(config-if)#do sh ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
Ethernet0/0                unassigned      YES unset  administratively down down
Ethernet0/1                unassigned      YES unset  administratively down down
Ethernet0/2                unassigned      YES unset  administratively down down
Ethernet0/3                unassigned      YES unset  administratively down down
Serial1/0                  12.1.1.1        YES manual up                    up  
Serial1/1                  unassigned      YES unset  administratively down down
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
```
**R2**
```sh
R2>en
R2#conf t
R2(config)#int s1/0
R2(config-if)#ip addr 12.1.1.2 255.255.255.252
R2(config-if)#clock rate 64000
R2(config-if)#no shut
R2(config-if)#do show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
Ethernet0/0                unassigned      YES unset  administratively down down
Ethernet0/1                unassigned      YES unset  administratively down down
Ethernet0/2                unassigned      YES unset  administratively down down
Ethernet0/3                unassigned      YES unset  administratively down down
Serial1/0                  12.1.1.2        YES manual up                    up  
Serial1/1                  unassigned      YES unset  administratively down down
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
```
**R1 ping R2**
```sh
R1(config-if)#do ping 12.1.1.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 12.1.1.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 9/11/14 ms
```

**在 R1、R2 設置一個 Loopback0 介面**
```sh
//R1
R1(config-if)#int lo 0
R1(config-if)#ip addr 1.1.1.1 255.255.255.255
R1(config)#do sh ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
Ethernet0/0                unassigned      YES unset  administratively down down
Ethernet0/1                unassigned      YES unset  administratively down down
Ethernet0/2                unassigned      YES unset  administratively down down
Ethernet0/3                unassigned      YES unset  administratively down down
Serial1/0                  12.1.1.1        YES manual up                    up  
Serial1/1                  unassigned      YES unset  administratively down down
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
Loopback0                  1.1.1.1         YES manual up                    up

//R2
R2(config-if)#int lo 0
R2(config-if)#ip addr 2.2.2.2 255.255.255.255
```

**對 R1、R2 序列埠加上路由**
```sh
# 有三種方式

//R1
# 最正規完整的方式
R1(config)#ip route 2.2.2.0 255.255.255.0 s1/0 12.1.1.2
R1(config)#ip route 2.2.2.0 255.255.255.0 12.1.1.2

# 對於序列埠可以直接寫 s1/0，因為序列埠只有一條路
R1(config)#ip route 2.2.2.0 255.255.255.0 s1/0

//R2
R2(config)#ip route 1.1.1.0 255.255.255.0 s1/0 12.1.1.1
```
**R1 ping R2**
```sh
R1(config)#do ping 2.2.2.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 2.2.2.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 7/11/14 ms

# 增加來源位址
R1(config)#do ping 2.2.2.2 source 1.1.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 2.2.2.2, timeout is 2 seconds:
Packet sent with a source address of 1.1.1.1
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 9/9/11 ms
```

## Test2 - 乙太網路接口
* 架構圖

![](Image/W4-20201007/Test2.PNG)

**R3**
```sh
R3(config)#int e0/0
R3(config-if)#ip addr 192.168.1.1 255.255.255.0
R3(config-if)#no shut

R3(config-if)#int lo 0
R3(config-if)#ip addr 3.3.3.3 255.255.255.255
```
**R4**
```sh
R4(config)#int e0/0
R4(config-if)#ip addr 192.168.1.2 255.255.255.0
R4(config-if)#no shut

R4(config-if)#int lo 0
R4(config-if)#ip addr 4.4.4.4 255.255.255.255
```
**R5**
```sh
R5(config)#int e0/0
R5(config-if)#ip addr 192.168.1.3 255.255.255.0
R5(config-if)#no shut

R5(config-if)#int lo 0
R5(config-if)#ip addr 5.5.5.5 255.255.255.255
```
**設置靜態路由**
```sh
R3(config)#ip route 4.4.4.0 255.255.255.0 e0/0 192.168.1.2
# ping 成功
R3(config)#do ping 4.4.4.4
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 4.4.4.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms

# 指定來源 ping 失敗
R3(config)#do ping 4.4.4.4 source 3.3.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 4.4.4.4, timeout is 2 seconds:
Packet sent with a source address of 3.3.3.3
.....
Success rate is 0 percent (0/5)
```
**解決**
```sh
R4(config-if)#ip route 3.3.3.0 255.255.255.0 e0/0 192.168.1.1
```
## Test3 - 整合實作
* 架構圖

![](Image/W4-20201007/Test3.PNG)

**R1**
```sh
R1(config)#int e0/1
R1(config-if)#ip addr 192.168.1.1 255.255.255.0
R1(config-if)#no shut

R1(config-if)#int e0/0
R1(config-if)#ip addr 12.1.1.1 255.255.255.0
R1(config-if)#no shut

R1(config)#ip dhcp pool DHCP1
R1(dhcp-config)#network 192.168.1.0 /24
R1(dhcp-config)#default-router 192.168.1.1
R1(dhcp-config)#dns-server 8.8.8.8
```
**VPC1**
```sh
VPCS> ip dhcp
DDORA IP 192.168.1.2/24 GW 192.168.1.1

VPCS> show ip

NAME        : VPCS[1]
IP/MASK     : 192.168.1.2/24
GATEWAY     : 192.168.1.1
DNS         : 8.8.8.8
DHCP SERVER : 192.168.1.1
DHCP LEASE  : 86393, 86400/43200/75600
MAC         : 00:50:79:66:68:06
LPORT       : 20000
RHOST:PORT  : 127.0.0.1:30000
MTU         : 1500
```
**R3**
```sh
R3(config)#int e0/0
R3(config-if)#ip addr 23.1.1.3 255.255.255.0
R3(config-if)#no shut

R3(config-if)#int e0/1
R3(config-if)#ip addr 192.168.2.1 255.255.255.0
R3(config-if)#no shut

R3(config)#ip dhcp pool DHCP2
R3(dhcp-config)#network 192.168.2.0 /24
R3(dhcp-config)#default-router 192.168.2.1
R3(dhcp-config)#dns-server 8.8.8.8
```
**VPC2**
```sh
VPCS> ip dhcp
DDORA IP 192.168.2.2/24 GW 192.168.2.1

VPCS> sh ip

NAME        : VPCS[1]
IP/MASK     : 192.168.2.2/24
GATEWAY     : 192.168.2.1
DNS         : 8.8.8.8
DHCP SERVER : 192.168.2.1
DHCP LEASE  : 86395, 86400/43200/75600
MAC         : 00:50:79:66:68:07
LPORT       : 20000
RHOST:PORT  : 127.0.0.1:30000
MTU         : 1500
```

**R2**
```sh
R2(config)#int e0/0
R2(config-if)#ip addr 12.1.1.2 255.255.255.0
R2(config-if)#no shut

R2(config-if)#int e0/1
R2(config-if)#ip addr 23.1.1.2 255.255.255.0
R2(config-if)#no shut
```

**設置靜態路由**
```sh
# 讓 PC1 可以 ping 12.1.1.2
R2(config)#ip route 192.168.1.0 255.255.255.0 e0/0 12.1.1.1
                                           # <初接口> <下一跳>
# 讓 PC1 可以 ping 23.1.1.2
R1(config)#ip route 23.1.1.0 255.255.255.0 e0/0 12.1.1.2

# 讓 PC1 可以 ping 23.1.1.3
R3(config)#ip route 192.168.1.0 255.255.255.0 e0/0 23.1.1.2

# 讓 PC1 可以 ping 192.168.2.1、192.168.2.2
R1(config)#ip route 192.168.2.0 255.255.255.0 e0/0 12.1.1.2
R2(config)#ip route 192.168.2.0 255.255.255.0 e0/1 23.1.1.3
```
